
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/8130402014)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 5 to destroy.</code></pre>

* Create
  * google_secret_manager_secret.backend-sa-secret[&#34;backend_allowed_domains&#34;]
  * google_secret_manager_secret.proxy-sa-secret[&#34;proxy_allowed_domains&#34;]
* Update
  * google_artifact_registry_repository.artifact-repository
* Delete
  * google_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;]
  * google_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;]
  * google_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;]
  * google_secret_manager_secret.proxy-sa-secret[&#34;allowed_domains&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_project_service.firebase-apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase-apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_secret_manager_secret.backend-sa-secret["backend_allowed_domains"] will be created
  + resource "google_secret_manager_secret" "backend-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "backend_allowed_domains"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.proxy-sa-secret["allowed_domains"] will be destroyed
  # (because key ["allowed_domains"] is not in for_each map)
  - resource "google_secret_manager_secret" "proxy-sa-secret" {
      - annotations           = {} -> null
      - create_time           = "2024-03-03T10:28:19.478566Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/gig-japan-398904/secrets/allowed_domains" -> null
      - labels                = {} -> null
      - name                  = "projects/139527520332/secrets/allowed_domains" -> null
      - project               = "gig-japan-398904" -> null
      - secret_id             = "allowed_domains" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # google_secret_manager_secret.proxy-sa-secret["proxy_allowed_domains"] will be created
  + resource "google_secret_manager_secret" "proxy-sa-secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "gig-japan-398904"
      + secret_id             = "proxy_allowed_domains"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

Plan: 2 to add, 1 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":112,"Program":"tfcmt","SHA1":"6dc2cd3d774b20e3b866f4ad96ce0887f707ac87","Vars":{},"WorkflowName":"iaac_plan"} -->